In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
!pwd

/content

In [4]:
!ls "/content/drive/My Drive/onehot_encoding_posidex"

Sample.csv

In [6]:
import pandas as pd

In [7]:
readdf = pd.read_csv("drive/My Drive/Sample.csv")

In [9]:
readdf.shape

(48, 11)

In [10]:
readdf.head()

                     MATCH_TYPE_Clean  address  city  ...  pan  phone  pincode
0              city,dob,lastname,name        0     1  ...    0      0        0
1                       city,dob,name        0     1  ...    0      0        0
2                   address,city,name        1     1  ...    0      0        0
3          address,city,lastname,name        1     1  ...    0      0        0
4  address,city,lastname,name,pincode        1     1  ...    0      0        1

[5 rows x 11 columns]

In [14]:
df = readdf[['MATCH_TYPE_Clean']]

In [15]:
df.shape

(48, 1)

In [16]:
df.head()

                     MATCH_TYPE_Clean
0              city,dob,lastname,name
1                       city,dob,name
2                   address,city,name
3          address,city,lastname,name
4  address,city,lastname,name,pincode

In [21]:
#new_df = pd.concat([df.drop('MATCH_TYPE_Clean', 1), df['MATCH_TYPE_Clean'].str.get_dummies(sep=",")], 1)
new_df = pd.concat([df, df['MATCH_TYPE_Clean'].str.get_dummies(sep=",")], 1)

new_df.head()

                     MATCH_TYPE_Clean  address  city  ...  pan  phone  pincode
0              city,dob,lastname,name        0     1  ...    0      0        0
1                       city,dob,name        0     1  ...    0      0        0
2                   address,city,name        1     1  ...    0      0        0
3          address,city,lastname,name        1     1  ...    0      0        0
4  address,city,lastname,name,pincode        1     1  ...    0      0        1

[5 rows x 11 columns]

In [22]:
new_df.shape

(48, 11)